In [1]:
#we will learn how to deal with NaN values in a dataset

In [2]:
#lets create a dataset first

In [4]:
import pandas as pd

In [5]:
df1=pd.DataFrame({"a":["a0","a1","a2"],"b":["b0","b1","b2"]},index=[0,1,2])

In [6]:
df1

    a   b
0  a0  b0
1  a1  b1
2  a2  b2

In [7]:
df2=pd.DataFrame({"a":["a3","a4","a5"],"b":["b3","b4","b5"]},index=[3,4,5])

In [8]:
df2

    a   b
3  a3  b3
4  a4  b4
5  a5  b5

In [9]:
q=pd.concat([df1,df2],axis=1)

In [10]:
q

     a    b    a    b
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2   a2   b2  NaN  NaN
3  NaN  NaN   a3   b3
4  NaN  NaN   a4   b4
5  NaN  NaN   a5   b5

In [11]:
#checking for null values

In [12]:
q.isnull()

       a      b      a      b
0  False  False   True   True
1  False  False   True   True
2  False  False   True   True
3   True   True  False  False
4   True   True  False  False
5   True   True  False  False

In [14]:
q.dropna() #removes the rows with null values----------->inplace=False(d)

Empty DataFrame
Columns: [a, b, a, b]
Index: []

In [15]:
q

     a    b    a    b
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2   a2   b2  NaN  NaN
3  NaN  NaN   a3   b3
4  NaN  NaN   a4   b4
5  NaN  NaN   a5   b5

In [16]:
q.fillna("FILL")

      a     b     a     b
0    a0    b0  FILL  FILL
1    a1    b1  FILL  FILL
2    a2    b2  FILL  FILL
3  FILL  FILL    a3    b3
4  FILL  FILL    a4    b4
5  FILL  FILL    a5    b5

In [17]:
#also for NaN , WE cant directly write NaN

In [18]:
import numpy as np

In [19]:
q["new"]=np.nan

In [20]:
q

     a    b    a    b  new
0   a0   b0  NaN  NaN  NaN
1   a1   b1  NaN  NaN  NaN
2   a2   b2  NaN  NaN  NaN
3  NaN  NaN   a3   b3  NaN
4  NaN  NaN   a4   b4  NaN
5  NaN  NaN   a5   b5  NaN

In [21]:
#now you know how to directly assign a row with nan values directly